# размер окна
SIZE = WINDOW_WIDTH, WINDOW_HEIGHT = 800, 800

# размер одной клетки. изменять нельзя, нужен для легкости чтения кода.
CELL_SIZE = 25

# цвет заднего фона
BACKGROUND_COLOR = (68, 100, 58)
# скорость перемещения игрока
PLAYER_MOVEMENT_SPEED = 5

# количество деревьев на карте
TREES_AMOUNT = 50
# количество камней на карте
ROCKS_AMOUNT = 15

# минимальное расстояние от игрока до ресурса (в пикселях), необходимое для добычи
MINING_DISTANCE = 100
# скорость добычи ресурсов (сколько тактов должно пройти, чтобы ресурс добавился в инвентарь)
MINING_SPEED = 10

# Продолжительность дня в тиках
LENGTH_OF_THE_DAY = 20000